*** Incorrectly incrementng a global variable from two threads
    #+BEGIN_SRC C :results pp :exports both
    static volatile int glob = 0;   /* "volatile" prevents compiler optimizations
                                       of arithmetic operations on 'glob' */
    void *                          /* Loop 'arg' times incrementing 'glob' */
    threadFunc(void *arg)
    {
        int loops = *((int *) arg);
        int loc, j;
    
        for (j = 0; j < loops; j++) {
            loc = glob;
            loc++;
            glob = loc;
        }
    
        return NULL;
    }

    pthread_t t1, t2;
    int loops, s;

    loops = 10000;

    s = pthread_create(&t1, NULL, threadFunc, &loops);
    if (s != 0) errExitEN(s, "pthread_create");
    s = pthread_create(&t2, NULL, threadFunc, &loops);
    if (s != 0) errExitEN(s, "pthread_create");

    s = pthread_join(t1, NULL);
    if (s != 0) errExitEN(s, "pthread_join");
    s = pthread_join(t2, NULL);
    if (s != 0) errExitEN(s, "pthread_join");

    printf("glob = %d\n", glob);
    #+END_SRC

    #+RESULTS:
    : glob = 12834 // The correct value should be 20,000
